package com.company;

public class Main {

    public static void main(String[] args) {
        /*
         *   Создание алфавита
         *   1.  Кодирование
         *   2.  Декодирование
         *   3.  Брутфорс
         *       после точки пробел; пробел после запятой; пробел после !, ?, ;, --.
         *       80%
         *       длина слова < 25
         *       не больше 4 гласных/согласных подряд
         *       '.' ' ' 'A'
         *   4.  Статистический Анализ
         *       Можно попробовать взять Thinking in java
         *       Ключ не ищется! Берется зашифрованный файл и расшифрованный аналогичный файл того же автора
         *       и происходит попытка расшифровки на основе добавочного файла.
         */
    }
}
